tap "homebrew/bundle"
brew "git"
brew "git-lfs"
brew "gh"
brew "chezmoi"
brew "just"
brew "zsh"
brew "tmux"
brew "neovim"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "tree"
brew "jq"
brew "coreutils"
brew "wget"
brew "curl"
brew "rsync"
brew "htop"
brew "uv"
brew "fnm"
brew "rustup"
brew "go"
brew "python@3.14"
brew "cmake"
brew "clang-format"
brew "shellcheck"
