# Canonical VS Code extension manifest, promoted from inventories/current-machine/vscode-extensions.txt.
amedomary.touchbarvscode
anthropic.claude-code
benbasha.claude-autopilot
bpruitt-goddard.mermaid-markdown-syntax-highlighting
charliermarsh.ruff
corker.vscode-micromamba
danielpinto8zz6.c-cpp-compile-run
davidanson.vscode-markdownlint
drblury.protobuf-vsc
eamodio.gitlens
github.copilot-chat
github.vscode-pull-request-github
google.colab
google.geminicodeassist
gruntfuggly.activitusbar
gruntfuggly.todo-tree
ibm.output-colorizer
james-yu.latex-workshop
jock.svg
marp-team.marp-vscode
mathcale.theme-dracula-refined
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-powertoys
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
ms-vscode.remote-server
mushan.vscode-paste-image
myriad-dreamin.tinymist
naumovs.color-highlight
njpwerner.autodocstring
omthemes.omthemes
redhat.vscode-yaml
rooveterinaryinc.roo-cline
rust-lang.rust-analyzer
saoudrizwan.claude-dev
shd101wyy.markdown-preview-enhanced
sst-dev.opencode
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
trond-snekvik.simple-rst
vivaxy.vscode-conventional-commits
vscode-icons-team.vscode-icons
wscats.qf
yzhang.markdown-all-in-one
